app/controllers/projects_controller.rb

  def show
    @tasks = current_user.tasks.where(:task_id == current_user.id)
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1

  def create
    @project = current_user.projects.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["content", "test"], ["user_id", 1], ["created_at", "2017-07-06 13:24:44.788634"], ["updated_at", "2017-07-06 13:24:44.788634"]]