app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."state" = ?  [["user_id", 1], ["state", "to_do"]]
---
  def index
    # @tasks = current_user.tasks
    @to_do = current_user.tasks.where(state: "to_do")

INSERT INTO "tasks" ("content", "created_at", "updated_at", "user_id", "title", "due_date") VALUES (?, ?, ?, ?, ?, ?)  [["content", "test task"], ["created_at", "2017-07-06 11:38:53.980571"], ["updated_at", "2017-07-06 11:38:53.980571"], ["user_id", 1], ["title", "test"], ["due_date", "2017-07-06 11:38:00"]]
---
  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = ?, "due_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "fsdgdfgff"], ["due_date", "2017-07-06 11:51:00"], ["updated_at", "2017-07-06 11:51:41.348334"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "doing"], ["updated_at", "2017-07-06 10:30:13.998467"], ["id", 2]]
---
  def change
    @task.update_attributes(state: params[:state])